set_db lib_search_path /home/install/FOUNDRY/digital/90nm/dig/lib
set_db hdl_search_path /Desktop/ASIC_COUNTER 
set_db library {slow.lib} 


read_hdl MUX2X1.v


elaborate MUX2X1 
check_design -unresolved
#read_sdc ~/Desktop/ASIC_COUNTER/counter_top.sdc

#synthesize -to_mapped -#ef                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                       #fort medium 

syn_gen
syn_map
syn_opt

#write_sdf -timescale ns -nonegchecks -recrem split -edges check_edge > delays.sdf 

report timing > mux_timing.txt 
report area > mux_cell.txt 

report power > mux_power.txt
report gates > mux_gates.txt

write_hdl > mux_netlist.v 
write_sdc > mux_const.sdc 
gui_show
